<a href="https://colab.research.google.com/github/Imsita/Python_Assignments/blob/main/Hive_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
Problem 01 :
UPDATE employee_data
SET extra_vacation =
  CASE
    WHEN tenure < 2 THEN 20
    WHEN tenure >= 2 AND tenure <= 10 THEN 30
    WHEN tenure > 10 THEN 40
  END;

Problem 02:

CREATE TABLE temperature (
  Date STRING,
  State STRING,
  Temperature ARRAY<DOUBLE>
);

INSERT INTO temperature (Date, State, Temperature)
VALUES ('2023-08-01', 'California', ARRAY[75.5, 80.2, 82.9]);

SELECT State, MAX(Temperature[1]) AS Max_Temperature
FROM temperature
GROUP BY State;

Problem 03:
CREATE TABLE student_marks (
  Name STRING,
  Marks Map<STRING, INT>
);

INSERT INTO student_marks (Name, Marks)
VALUES ('John', '{"Maths": 95, "Physics": 88, "Chemistry": 92}');

SELECT Name
FROM student_marks
WHERE Marks['Maths'] > 90;

SELECT Name, Marks['Physics'] AS Physics_Marks
FROM student_marks;

SELECT Name, MAX(Marks[subject]) AS Max_Subject_Marks
FROM student_marks,
LATERAL (SELECT subject FROM UNNEST(Marks) AS subject) AS subjects
GROUP BY Name;

SELECT Name, AVG(Marks[subject]) AS Average_Marks_Scored
FROM student_marks,
LATERAL (SELECT subject FROM UNNEST(Marks) AS subject) AS subjects
GROUP BY Name;

SELECT Name, (SUM(Marks[subject]) * 100 / (COUNT(Marks) * 100)) AS Percentage_Marks
FROM student_marks,
LATERAL (SELECT subject FROM UNNEST(Marks) AS subject) AS subjects
GROUP BY Name;

Problem 04:
CREATE TABLE student_info (
    Name VARCHAR(100),
    Marks JSON, -- Assuming JSON data for Map<STRING, INT>
    Address STRUCT (
        doorNo INT,
        Location VARCHAR(100),
        Pincode INT
    )
);

SELECT Name
FROM student_info
WHERE Address.Location = 'Banashankari';

SELECT COUNT(*)
FROM student_info
WHERE Address.Pincode = 560001;